# Задача 14: Требуется вывести все целые степени двойки (т.е. числа вида 2k), не превосходящие числа N.

n=int (input ("Введите число: "))
k=2
m=1
while m<n:
    print (m)
    m=m*k